In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\chandrika\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\chandrika\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\chandrika\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\chandrika\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\chandrika\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [1]:
import pandas as pd

In [2]:
data = pd.read_excel(r"C:\Users\supri\Downloads\Movies_Dataset.xlsx")

In [3]:
print(data)

     Movie Name      Genre  Release_Year  IMDb_Rating  Revenue
0       Movie 1     Sci-Fi          2000          6.0  1680.53
1       Movie 2  Adventure          2000          2.2   987.24
2       Movie 3    Romance          2002          5.2  1122.13
3       Movie 4    Romance          2001          4.5   581.84
4       Movie 5     Action          2012          6.6  1205.51
..          ...        ...           ...          ...      ...
995   Movie 996     Sci-Fi          2013          8.7   456.39
996   Movie 997  Adventure          1993          6.2  1255.27
997   Movie 998    Fantasy          2016          8.1  1161.96
998   Movie 999     Action          1996          8.9   941.67
999  Movie 1000     Horror          1995          9.4  1390.70

[1000 rows x 5 columns]

In [4]:
data.head()

  Movie Name      Genre  Release_Year  IMDb_Rating  Revenue
0    Movie 1     Sci-Fi          2000          6.0  1680.53
1    Movie 2  Adventure          2000          2.2   987.24
2    Movie 3    Romance          2002          5.2  1122.13
3    Movie 4    Romance          2001          4.5   581.84
4    Movie 5     Action          2012          6.6  1205.51

In [5]:
data.tail()

     Movie Name      Genre  Release_Year  IMDb_Rating  Revenue
995   Movie 996     Sci-Fi          2013          8.7   456.39
996   Movie 997  Adventure          1993          6.2  1255.27
997   Movie 998    Fantasy          2016          8.1  1161.96
998   Movie 999     Action          1996          8.9   941.67
999  Movie 1000     Horror          1995          9.4  1390.70

In [6]:
#all movies in action genre
data_1 = data[data['Genre'] == 'Action']
print(data_1)

    Movie Name   Genre  Release_Year  IMDb_Rating  Revenue
4      Movie 5  Action          2012          6.6  1205.51
34    Movie 35  Action          2009          8.7   545.60
64    Movie 65  Action          2023          7.7  1137.79
65    Movie 66  Action          1999          3.1  1335.85
73    Movie 74  Action          2001          4.1   350.80
..         ...     ...           ...          ...      ...
930  Movie 931  Action          1994          8.6  1863.66
944  Movie 945  Action          2004          7.5  1709.81
980  Movie 981  Action          2022          5.2    28.40
988  Movie 989  Action          2023          4.1   231.67
998  Movie 999  Action          1996          8.9   941.67

[104 rows x 5 columns]

In [7]:
#movies released after 2000
rel = data[data['Release_Year']>2000]
print(rel)

    Movie Name     Genre  Release_Year  IMDb_Rating  Revenue
2      Movie 3   Romance          2002          5.2  1122.13
3      Movie 4   Romance          2001          4.5   581.84
4      Movie 5    Action          2012          6.6  1205.51
6      Movie 7   Mystery          2021          5.1  1683.99
7      Movie 8    Comedy          2005          4.0  1062.13
..         ...       ...           ...          ...      ...
988  Movie 989    Action          2023          4.1   231.67
989  Movie 990   Fantasy          2004          1.6  1056.58
991  Movie 992  Thriller          2004          9.2   251.25
995  Movie 996    Sci-Fi          2013          8.7   456.39
997  Movie 998   Fantasy          2016          8.1  1161.96

[518 rows x 5 columns]

In [8]:
rating = data[data['IMDb_Rating']>8.5]
print(rating)

     Movie Name      Genre  Release_Year  IMDb_Rating  Revenue
34     Movie 35     Action          2009          8.7   545.60
51     Movie 52    Mystery          1998          9.0  1089.93
56     Movie 57     Comedy          1993          9.2  1586.13
74     Movie 75  Adventure          1999          8.6  1688.49
81     Movie 82    Mystery          1997          8.6  1238.32
..          ...        ...           ...          ...      ...
991   Movie 992   Thriller          2004          9.2   251.25
992   Movie 993     Horror          1985          9.6   951.23
995   Movie 996     Sci-Fi          2013          8.7   456.39
998   Movie 999     Action          1996          8.9   941.67
999  Movie 1000     Horror          1995          9.4  1390.70

[148 rows x 5 columns]

In [9]:
data[['Movie Name','Genre']]

     Movie Name      Genre
0       Movie 1     Sci-Fi
1       Movie 2  Adventure
2       Movie 3    Romance
3       Movie 4    Romance
4       Movie 5     Action
..          ...        ...
995   Movie 996     Sci-Fi
996   Movie 997  Adventure
997   Movie 998    Fantasy
998   Movie 999     Action
999  Movie 1000     Horror

[1000 rows x 2 columns]

In [10]:
data_2 = data[(data['Release_Year'] >= 1990) & (data['Release_Year'] <= 2010)]
print(data_2)

     Movie Name      Genre  Release_Year  IMDb_Rating  Revenue
0       Movie 1     Sci-Fi          2000          6.0  1680.53
1       Movie 2  Adventure          2000          2.2   987.24
2       Movie 3    Romance          2002          5.2  1122.13
3       Movie 4    Romance          2001          4.5   581.84
5       Movie 6    Fantasy          1997          2.4   485.22
..          ...        ...           ...          ...      ...
991   Movie 992   Thriller          2004          9.2   251.25
994   Movie 995     Sci-Fi          1997          2.0   342.98
996   Movie 997  Adventure          1993          6.2  1255.27
998   Movie 999     Action          1996          8.9   941.67
999  Movie 1000     Horror          1995          9.4  1390.70

[500 rows x 5 columns]

In [11]:
data['Genre'].value_counts()

Genre
Drama        113
Comedy       110
Fantasy      107
Thriller     107
Action       104
Adventure     96
Sci-Fi        93
Romance       91
Horror        90
Mystery       89
Name: count, dtype: int64

In [12]:
data_3 = data[data['IMDb_Rating'] == data['IMDb_Rating'].max()]
print(data_3)

    Movie Name    Genre  Release_Year  IMDb_Rating  Revenue
106  Movie 107  Romance          2007         10.0  1837.45
241  Movie 242   Comedy          2006         10.0   802.61
472  Movie 473  Fantasy          1985         10.0   845.18
564  Movie 565   Action          2020         10.0   943.50
610  Movie 611  Mystery          2017         10.0  1355.06
628  Movie 629  Mystery          1994         10.0   644.31

In [13]:
data['IMDb_Rating'].mean()

5.458600000000001

In [14]:
data['Revenue'].sum()

1049716.26

In [15]:
movies = data[data['Revenue']>500]
print(movies)

     Movie Name      Genre  Release_Year  IMDb_Rating  Revenue
0       Movie 1     Sci-Fi          2000          6.0  1680.53
1       Movie 2  Adventure          2000          2.2   987.24
2       Movie 3    Romance          2002          5.2  1122.13
3       Movie 4    Romance          2001          4.5   581.84
4       Movie 5     Action          2012          6.6  1205.51
..          ...        ...           ...          ...      ...
993   Movie 994  Adventure          1989          7.3  1273.65
996   Movie 997  Adventure          1993          6.2  1255.27
997   Movie 998    Fantasy          2016          8.1  1161.96
998   Movie 999     Action          1996          8.9   941.67
999  Movie 1000     Horror          1995          9.4  1390.70

[774 rows x 5 columns]

In [16]:
data['Rank'] = data['IMDb_Rating'].rank(ascending=False)
data.head()

  Movie Name      Genre  Release_Year  IMDb_Rating  Revenue   Rank
0    Movie 1     Sci-Fi          2000          6.0  1680.53  432.5
1    Movie 2  Adventure          2000          2.2   987.24  869.0
2    Movie 3    Romance          2002          5.2  1122.13  529.5
3    Movie 4    Romance          2001          4.5   581.84  609.5
4    Movie 5     Action          2012          6.6  1205.51  353.5

In [17]:
data.sort_values(by='Release_Year',ascending=False)
data.head(10)

  Movie Name      Genre  Release_Year  IMDb_Rating  Revenue   Rank
0    Movie 1     Sci-Fi          2000          6.0  1680.53  432.5
1    Movie 2  Adventure          2000          2.2   987.24  869.0
2    Movie 3    Romance          2002          5.2  1122.13  529.5
3    Movie 4    Romance          2001          4.5   581.84  609.5
4    Movie 5     Action          2012          6.6  1205.51  353.5
5    Movie 6    Fantasy          1997          2.4   485.22  844.5
6    Movie 7    Mystery          2021          5.1  1683.99  545.5
7    Movie 8     Comedy          2005          4.0  1062.13  672.5
8    Movie 9     Horror          1992          2.8  1592.74  815.0
9   Movie 10      Drama          1996          3.2  1352.66  765.5

In [18]:
data[data.duplicated(subset=['Movie Name'])]

   Movie Name      Genre  Release_Year  IMDb_Rating  Revenue   Rank
12   Movie 10      Drama          1996          3.2  1352.66  765.5
13   Movie 11    Mystery          2003          6.3   596.43  392.0
14   Movie 12     Sci-Fi          1988          3.0  1134.01  786.5
20   Movie 16     Comedy          2006          2.3  1322.79  856.0
21   Movie 17     Horror          2007          6.2  1114.31  406.5
22   Movie 18  Adventure          1998          7.9  1426.73  221.0
23   Movie 19     Comedy          1986          6.0  1783.44  432.5
24   Movie 20    Fantasy          1982          6.9  1598.08  329.0

In [19]:
data.drop_duplicates(subset=['Movie Name'])

     Movie Name      Genre  Release_Year  IMDb_Rating  Revenue   Rank
0       Movie 1     Sci-Fi          2000          6.0  1680.53  432.5
1       Movie 2  Adventure          2000          2.2   987.24  869.0
2       Movie 3    Romance          2002          5.2  1122.13  529.5
3       Movie 4    Romance          2001          4.5   581.84  609.5
4       Movie 5     Action          2012          6.6  1205.51  353.5
..          ...        ...           ...          ...      ...    ...
995   Movie 996     Sci-Fi          2013          8.7   456.39  131.5
996   Movie 997  Adventure          1993          6.2  1255.27  406.5
997   Movie 998    Fantasy          2016          8.1  1161.96  199.5
998   Movie 999     Action          1996          8.9   941.67  104.5
999  Movie 1000     Horror          1995          9.4  1390.70   54.0

[992 rows x 6 columns]

In [20]:
dataa = data['Genre'].replace('Sci-Fi','Science Fiction')
print(dataa)

0      Science Fiction
1            Adventure
2              Romance
3              Romance
4               Action
            ...
995    Science Fiction
996          Adventure
997            Fantasy
998             Action
999             Horror
Name: Genre, Length: 1000, dtype: object

In [21]:
data['Movie Name'].head(10)

0     Movie 1
1     Movie 2
2     Movie 3
3     Movie 4
4     Movie 5
5     Movie 6
6     Movie 7
7     Movie 8
8     Movie 9
9    Movie 10
Name: Movie Name, dtype: object

In [22]:
data['Movie Name'].tail(5)

995     Movie 996
996     Movie 997
997     Movie 998
998     Movie 999
999    Movie 1000
Name: Movie Name, dtype: object

In [23]:
data.groupby('Genre')['IMDb_Rating'].mean()

Genre
Action       5.670192
Adventure    5.012500
Comedy       5.442727
Drama        5.173451
Fantasy      5.200000
Horror       5.814444
Mystery      5.778652
Romance      5.938462
Sci-Fi       5.445161
Thriller     5.267290
Name: IMDb_Rating, dtype: float64

In [24]:
data['Release_Year'].value_counts().sort_index()

Release_Year
1980    26
1981    17
1982    21
1983    16
1984    16
1985    28
1986    21
1987    17
1988    20
1989    30
1990    21
1991    21
1992    26
1993    21
1994    23
1995    27
1996    26
1997    22
1998    29
1999    25
2000    29
2001    23
2002    24
2003    25
2004    20
2005    21
2006    23
2007    29
2008    24
2009    21
2010    20
2011    23
2012    20
2013    26
2014    20
2015    23
2016    14
2017    18
2018    18
2019    15
2020    20
2021    16
2022    25
2023    18
2024    32
Name: count, dtype: int64

In [25]:
data.groupby('Genre')['Revenue'].sum()

Genre
Action       111137.94
Adventure    103864.42
Comedy       122686.63
Drama        120311.32
Fantasy      109849.86
Horror        90395.52
Mystery       98832.93
Romance       94413.72
Sci-Fi        85811.80
Thriller     112412.12
Name: Revenue, dtype: float64